Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.WallAMLostAdjustmentReference Property
 Wall Analytical Model has lost its adjustment reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallAMLostAdjustmentReference { get; }
Public Shared ReadOnly Property WallAMLostAdjustmentReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallAMLostAdjustmentReference {
	FailureDefinitionId^ get ();
}
static member WallAMLostAdjustmentReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace